{
  "meta": {
    "desc": "Isometric 3D RPG similar to game Diablo",
    "desc_long": "<para>\n  FreedroidRPG is an original isometric 3D role playing game\n  taking place in the future, on Earth. It features action and\n  dialogs.\n</para>\n<para>\n  The game tells the story of a world destroyed by a conflict between\n  robots and their human masters. Play as Tux in a quest to save the\n  world from the murderous rebel bots who know no mercy. You get to\n  choose which path you wish to follow, and freedom of choice is\n  everywhere in the game.\n</para>\n<para>\n  FreedroidRPG features a real time combat system with melee and\n  ranged weapons, fairly similar to the proprietary game Diablo.\n  There is an innovative system of programs that can be run in order\n  to take control of enemy robots, alter their behavior, or improve one's\n  characteristics. You can use over 50 different kinds of items and\n  fight countless enemies on your way to your destiny. An advanced\n  dialog system provides story background and immersive role\n  playing situations.\n</para>\n<para>\n  The game is complete, fully playable, and can provide about\n  12 hours of fun. It is still being actively developed, and\n  help is welcome in many areas. People having - or trying to acquire -\n  programming, map editing, or writing skills will find FreedroidRPG\n  to be an exciting, fast-moving project in which they can fully\n  express their creativity.\n</para>\n",
    "home": "https://www.freedroid.org/",
    "license": {
      "deprecated": false,
      "free": true,
      "fullName": "GNU General Public License v2.0 or later",
      "redistributable": true,
      "shortName": "gpl2Plus",
      "spdxId": "GPL-2.0-or-later",
      "url": "https://spdx.org/licenses/GPL-2.0-or-later.html"
    },
    "maintainers": [
      {
        "email": "jtojnar@gmail.com",
        "github": "jtojnar",
        "githubId": 705123,
        "matrix": "@jtojnar:matrix.org",
        "name": "Jan Tojnar"
      }
    ]
  },
  "versions": [
    {
      "first": "039428d3b2908e295fbcc83a6b5b9cc03f75c3fb",
      "last": "0182d4040348dbe481bc5e897cc504e0134fd6e3",
      "name": "0.16.1"
    }
  ]
}