{
  "meta": {
    "desc": "Photoelectronic microtonal/spectral musical instrument",
    "desc_long": "Virtual ANS is a software simulator of the unique Russian synthesizer ANS\n- photoelectronic musical instrument created by Evgeny Murzin from 1938 to\n1958. The ANS made it possible to draw music in the form of a spectrogram\n(sonogram), without live instruments and performers. It was used by\nStanislav Kreichi, Alfred Schnittke, Edward Artemiev and other Soviet\ncomposers in their experimental works. You can also hear the sound of the\nANS in Andrei Tarkovsky's movies Solaris, The Mirror, Stalker.\n\nThe simulator extends the capabilities of the original instrument. Now\nit's a full-featured graphics editor where you can convert sound into an\nimage, load and play pictures, draw microtonal/spectral music and create\nsome unusual deep atmospheric sounds. This app is for everyone who loves\nexperiments and is looking for something new.\n\nKey features:\n\n+ unlimited number of pure tone generators;\n+ powerful sonogram editor - you can draw the spectrum and play it at the same time;\n+ any sound (from a WAV file or a Microphone/Line-in) can be converted to image (sonogram) and vice versa;\n+ support for MIDI devices;\n+ polyphonic synth mode with MIDI mapping;\n+ supported file formats: WAV, AIFF, PNG, JPEG, GIF;\n+ supported sound systems: ASIO, DirectSound, MME, ALSA, OSS, JACK, Audiobus, IAA.\n",
    "home": "https://warmplace.ru/soft/ans/",
    "license": {
      "deprecated": false,
      "free": true,
      "fullName": "Unspecified free software license",
      "redistributable": true,
      "shortName": "free"
    },
    "maintainers": [
      {
        "email": "jacg@my-post-office.net",
        "github": "jacg",
        "githubId": 2570854,
        "name": "Jacek Generowicz"
      }
    ]
  },
  "versions": [
    {
      "first": "05a4dc3ce99b46e9a8bf72aebdc19e94d8f38b46",
      "last": "04a15518c1a1fe06663e4d18d610ccd983c6fa6a",
      "name": "3.0.2c"
    }
  ]
}